app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
    def index
        @event = Event.all

INSERT INTO `events` (`name`, `description`, `time`, `created_at`, `updated_at`) VALUES ('Diklat', 'diklat adalah kegiatan pelatihan', '2019-11-28', '2019-11-29 14:55:38', '2019-11-29 14:55:38')
---
    def create
        @event = Event.new(params_e)
        if @event.save