app/controllers/members_controller.rb

SELECT `members`.* FROM `members`
---
    def index
        @member = Member.all

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
---
    def show
        @member = Member.find(params[:id])

INSERT INTO `members` (`name`, `nim`, `fakultas`, `created_at`, `updated_at`) VALUES ('bayu', 'A11.2017', 'TI', '2019-11-16 13:23:42', '2019-11-16 13:23:42')
---
    def create
        @member = Member.new(params_a)
        if @member.save

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 0 LIMIT 1
---
    def edit
        @member = Member.find(params[:id])

SELECT  `members`.* FROM `members` WHERE `members`.`id` = 1 LIMIT 1
UPDATE `members` SET `fakultas` = 'Teknik Informatika', `updated_at` = '2019-11-16 23:49:45' WHERE `members`.`id` = 1
---
    def update
        @member = Member.find(params[:id])
        if @member.update_attributes(params_a)